Model: "actor"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 3)]               0
_________________________________________________________________
batch_normalization (BatchNo (None, 3)                 12
_________________________________________________________________
dense (Dense)                (None, 200)               800
_________________________________________________________________
dense_1 (Dense)              (None, 100)               20100
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 101
_________________________________________________________________
tf_op_layer_mul (TensorFlowO (None, 1)                 0
=================================================================
Total params: 21,013
Trainable params: 21,007
Non-trainable params: 6
_________________________________________________________________
None

Model: "critic"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_4 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 1)]          0
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 4)            0           input_4[0][0]
                                                                 input_3[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 4)            16          concatenate[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 200)          1000        batch_normalization_2[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 100)          20100       dense_6[0][0]
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1)            101         dense_7[0][0]
==================================================================================================
Total params: 21,217
Trainable params: 21,209
Non-trainable params: 8
__________________________________________________________________________________________________
None

Model: "target_actor"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_2 (InputLayer)         [(None, 3)]               0
_________________________________________________________________
batch_normalization_1 (Batch (None, 3)                 12
_________________________________________________________________
dense_3 (Dense)              (None, 200)               800
_________________________________________________________________
dense_4 (Dense)              (None, 100)               20100
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 101
_________________________________________________________________
tf_op_layer_mul_1 (TensorFlo (None, 1)                 0
=================================================================
Total params: 21,013
Trainable params: 21,007
Non-trainable params: 6
_________________________________________________________________
None

Model: "target_critic"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_6 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
input_5 (InputLayer)            [(None, 1)]          0
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4)            0           input_6[0][0]
                                                                 input_5[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 4)            16          concatenate_1[0][0]
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 200)          1000        batch_normalization_3[0][0]
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 100)          20100       dense_9[0][0]
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 1)            101         dense_10[0][0]
==================================================================================================
Total params: 21,217
Trainable params: 21,209
Non-trainable params: 8
__________________________________________________________________________________________________
None
